<template>
  <div>
    <h1 class="title">SoulWind CRM</h1>
    <p>
      Данная CRM система помогает в ведении учета гильдии.
      <br />
      На данный момент она находится в бета режиме, поэтому может иметь большое
      кол-во ошибок.
    </p>

    <h2>
      Что не реализованно на данный момент, но будет реализовано в будущем
    </h2>
    <p>Список будет реализовываться сверху вниз</p>
    <ul>
      <li>
        Нет уведомлений об запросах на сервер (инфо об ошибке выводится только в
        консоль)
      </li>
      <li>
        Кнопки не исчезают и не дизейблятся если у вас недостаточно прав для
        чего либо, но если вы попытаетесь использовать что либо, на что у вас
        нет прав, вас деавторизирует.
      </li>
      <li>
        Так же могут возникать ошибки при изменении каких либо данных или
        страница может падать <br />
        пишите на почту
        <a href="mailto:swdevstudio@gmail.com">swdevstudio@gmail.com</a> с темой
        "Баги soulwind"
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
import { Component } from "nuxt-property-decorator"
import Vue from "vue"

@Component({
  name: "Index",
})
export default class Index extends Vue {}
</script>

<style></style>
